<template>
	<frame-template>
		<card title="サークル参加をする方へ">
			<div class="info" v-for="card in infoList">
				<h2>{{card.title}}</h2>
				<p class="line" v-for="text in card.text">
					{{text}}
				</p>
				<template v-if="card.link">
					<a :href="card.link.href">{{card.link.text}}</a>
				</template>
			</div>
		</card>
		<card title="プライバシーポリシー">
			<div class="info policy">
			　戦挙管理委員会（以下「当会」といいます）は、個人情報の保護に関する法令等を遵守するとともに、本プライバシーポリシーを遵守します。<br>
1. 個人情報の定義<br>
　個人情報とは、氏名、住所、生年月日、年齢、性別、電話番号、電子メールアドレス、IPアドレス、銀行口座番号のうち、1つあるいは2つ以上を組み合せることによって、特定の個人を識別できるものを指します。<br>
2. 個人情報の取得<br>
　当会は、個人情報を、適正な手段により取得いたします。<br>
3. 個人情報の利用目的<br>
　当会は、主催する即売会・イベント等において、個人情報を、以下の目的で利用し、ご本人の同意を頂いた範囲内においてのみ取り扱います。<br>
(1) 即売会・イベント等の運営に必要な情報を処理するため<br>
(2) 即売会・イベント等に関する重要事項を参加者に連絡するため<br>
(3) 即売会・イベント等の運営上のトラブルを解決するため<br>
4. 個人情報の第三者への提供<br>
　当会は、個人情報保護法その他の法令により認められる事由がある場合を除き、ご本人の同意なくして、第三者に提供・開示しません。<br>
5. 個人情報の安全管理<br>
　当会は、個人情報を適切に管理し、個人情報の漏えい、滅失、毀損等に対する予防措置を講じます。<br>
6. 個人情報の開示、訂正、苦情等<br>
　当会は、個人情報について、開示、訂正、苦情等について、ご本人からのお申出があった場合には、お申出頂いた方がご本人であることを確認の上、個人情報保護法の定めに従い、速やかに対応いたします。<br>
7. プライバシーポリシーの変更<br>
　当会は、必要に応じて、本プライバシーポリシーの内容を改定することがあります。その場合、変更箇所を速やかに公表するものとします。<br>
8. お問い合わせ窓口<br>
　戦挙管理委員会　seimani.only[at]gmail.com
			</div>
		</card>
		<card>
			<button class="registerButton" @click="register">上記内容を熟読した上で参加登録を行う</button>
		</card>
	</frame-template>
</template>

<script>
import FrameTemplate from "~/components/FrameTemplate.vue";
import Card from "~/components/Card.vue";

export default {
	head() {
		return {
			title: this.title,
		};
	},
	data: () => ({
		title: "サークル参加",
		infoList: [
			{
				title: "はじめに",
				text: `当イベントにて二次創作作品の頒布や展示を希望される総理には、サークル参加の事前申込をお願いしております。
下記の諸注意をお読みいただいた上で、所定の方法にてお申し込みください。
なお、ご不明な点がございましたら、お気軽にメールアドレス宛にお問い合わせください。`.split("\n"),
			},
			{
				title: "イベント名",
				text: "「政剣マニフェスティア」非公式オンリーイベント（仮称）".split("\n"),
			},
			{
				title: "日程・会場",
				text: `2018年9月24日（振替休日・月曜日）
川崎市産業振興会館 4階 企画展示場`.split("\n"),
			},
			{
				title: "開催当日のスケジュール（予定）",
				text: `10:00 サークル総理受付開始
※搬入する物品が多い場合はご相談ください。対応いたします。
11:50 サークル総理受付終了
12:00 即売会開始、一般総理入場
13:30 宅急便受付開始
14:00 即売会終了
14:30 アフターイベント開始
16:00 アフターイベント終了
※スケジュールは変更することがあります。その際は随時告知します。`.split("\n"),
			},
			{
				title: "サークル参加資格",
				text: `☆「政剣マニフェスティア」の二次創作作品を1点以上頒布または展示できること
☆ 開催当日までメールで《確実に》連絡可能であること
☆ "戦挙権"を持っていること`.split("\n"),
			},
			{
				title: "サークル参加費用",
				text: `1スペース 3500円
[含まれるもの]
 長机半分（幅900mm*奥行600mm）、イス1脚、入場証2枚、パンフレット引換券1枚
※追加イス 500円/1名
※追加入場証 500円/1名
※複数スペース申込・合体申込可能
（例）2スペース申込 7000円 長机1つ分（幅1800mm*奥行600mm）、イス2脚、入場証4枚、パンフレット引換券2枚

参加費は事前振込を予定しております。詳細は、申込締切後にメールにてご連絡いたします。`.split("\n"),
			},
			{
				title: "申込締切",
				text: `2018年7月20日 23:59まで
※申込後のキャンセルはお受けできません。`.split("\n"),
			},
			{
				title: "参加申込方法",
				text: "「オンライン申し込みフォーム」からお申し込み下さい。".split("\n"),
			},
			{
				title: "サークルカットについて",
				text: `ファイル形式：Photoshop形式(.psd) 600dpi(横1654px × 縦1181px) グレースケール推奨
※レイヤーは全て統合して下さい。
または PNG形式(.png) (横1654px × 縦1181px)
※アナログ原稿およびオフラインでのサークルカット受付は行いません。
※過度なわいせつ・暴力表現を含んだサークルカットは禁止です。
※サークルカット内に必ずサークル名をお入れください。`.split("\n"),
				link: {
					text: "サークルカットテンプレート(ZIP形式)",
					href: "/dl/circle_cut.zip",
				},
			},
			{
				title: "宅配便による搬入・搬出",
				text: `ヤマト運輸の宅急便をご利用いただけます。
伝票の記載例など、注意点は後日改めてご案内します。`.split("\n"),
			},
			{
				title: "その他",
				text: `・イベント当日に見本誌を回収いたします。奥付または奥付に準ずる欄に著者名やサークル名の表記がない場合、頒布をお断りすることがあります。
・グッズの見本回収はいたしません。開場前にスタッフが頒布グッズの確認をいたしますので、ご協力をお願いいたします。
・申込フォームの「成人向け作品」欄にて「無」を選択されたサークル様は、形態を問わず成人向け作品の頒布および展示が禁止となります。変更がある場合は、事前に主催までご連絡ください。
・電源の使用はできません。
・駐車場のご用意はできません。搬入・搬出時に車両を使用する場合は、事前に主催までご相談ください。
・飲食は可能ですが、会場を汚されないようにお願いいたします。
・ゴミは各自お持ち帰りください。ご協力をお願いいたします。`.split("\n"),
			},
		],
	}),
	methods: {
		register() {
			alert("まだgoogle formを作ってないんだなぁ");
		},
	},
	components: {
		FrameTemplate,
		Card,
	},
};
</script>

<style scoped>
.info {
	line-height: 1.75;
	margin: 10px 0;
	& .line {
		margin-left: 1rem;
	}
}

.registerButton {
	width: 100%;
	height: 3rem;
	font-size: 1.25rem;
	color: white;
	background-color: #284386;
	border-color: #001f65;
	border-radius: 5px;
}
</style>
