<template>
	<frame-template>
		<card title="コスプレ参加をする方へ">
			<div class="info" v-for="card in infoList">
				<h2>{{card.title}}</h2>
				<p class="line" v-for="text in card.text">
					{{text}}
				</p>
				<template v-if="card.link">
					<a :href="card.link.href">{{card.link.text}}</a>
				</template>
			</div>
		</card>
	</frame-template>
</template>

<script>
import FrameTemplate from "~/components/FrameTemplate.vue";
import Card from "~/components/Card.vue";

export default {
	head() {
		return {
			title: this.title,
		};
	},
	data: () => ({
		title: "コスプレ参加",
		infoList: [
			{
				title: "入場について",
				text: `・更衣室開放時間は【10:00〜18:00】となっております。
・サークル参加のコスプレ総理は、10:00から即売会エリアへの入場が可能です。
・サークル参加ではないコスプレ総理は、12:00の一般総理入場開始まで、更衣室内でお待ちください。
・更衣室入室の際、イベント入場料の他、コスプレ登録・更衣室使用料として【500円】を頂戴いたします。
・コスプレ参加名簿に総理ネームをご記入いただきます。ご協力をお願いいたします。
・当日お困りの事や不明点がございましたら、最寄りの戦挙管理委員（スタッフ）までお声がけください。`.split("\n"),
			},
			{
				title: "更衣について",
				text: `・更衣室は所定の更衣室のみをご利用ください。
・トイレでの着替えや、ヘアースプレーなどの使用、地毛及びウィッグのカットは厳禁です。
・更衣室はきれいにご使用ください。荷物・ゴミ等の放置は禁止です。
・更衣室内での一切の撮影行為を禁止します。
・更衣室は【18:00完全閉鎖】となります。時間は厳守いただきますよう、お願いいたします。`.split("\n"),
			},
			{
				title: "衣装について",
				text: `・国内外を問わず、リアルな軍服・国旗・階級章の着用は禁止します。実在の人物、団体とは何の関係もないただの美少女が戦うファンタジーですからね。
・コスプレや、コスプレと思われるような衣服・派手なメイクでの入退場は禁止です。一般常識の範囲内におさまる服装でご来場ください。
・過度に露出の多いコスチュームはお避けください。公式立ち絵に従う範囲で、必ずボディスーツ・肌着・サポーターなどを着用し、露出対策をお願いいたします。
・水着コスプレはご遠慮ください。
・コスプレとしての着ぐるみ(頭にかぶり物をしていて顔が見えないものを指します)の着用は可能です。
・女装をする男性コスプレ総理の方は、わき毛、すね毛、ひげなどの露出する部分の毛は処理をし、生足の露出は避けてタイツ、ストッキング、スパッツ等を着用してください。他階に一般の方もいらっしゃる会場ですので、ご協力をお願い申し上げます。
・更衣室の入退室時は、戦挙管理委員による衣装チェックにご協力ください。過度な露出が認められる場合は、上着などの着用をお願いすることがございます。
・戦挙管理委員から衣装修正の指示を受けた総理は更衣室に戻り、その箇所を速やかに修正してください。`.split("\n"),
			},
			{
				title: "コスプレ可能エリアについて",
				text: `・コスプレは【4階の即売会エリア、更衣室、庭園、10階和室のみ可能】です。
・他階には、本イベントと無関係な一般の方もいらっしゃいます。指定エリア以外に出る場合は、一度更衣室にてお着替えいただく必要があります。
・コスプレ状態でのエレベーター利用は、他の利用者へのご迷惑となりますので、ご遠慮ください。
・10階和室への移動の際は、コスプレ担当委員にお声がけの上、その指示に従うようにお願いいたします。`.split("\n"),
			},
			{
				title: "会場内マナーについて",
				text: `・会場内を走ることや、場内・周辺でのパフォーマンス等（走る・飛ぶ・騒ぐ・振り回す・楽器をならす等の行為）はおやめください。事故や怪我のもととなります。
・長物などは破損や周囲の邪魔になる恐れがありますので、会場外およびサークルスペースではケース等に入れて持ち運びください。
・お荷物は更衣室での預かりが可能ですが、貴重品は必ずご携帯ください。万一紛失されましても、責任を負いかねます。あらかじめご了承ください。
・イベント時間中に落し物や紛失物が発生した場合は、本部までお越しください。
・不審物を発見した場合、不用意に触らず戦挙管理委員をお呼びください。`.split("\n"),
			},
			{
				title: "持ち込み可能物品について",
				text: `・エアガン他、素材が固く、人に当たると危害をあたえるおそれのあるものの持ち込みは禁止です。
持ち込み不可な素材例：金属等硬質で尖っているあるいは切断面が鋭利なもの
持ち込み可能な素材例：ダンボールウレタン（ライオンボード）/紙柔らかい粘土（乾燥しても過度に固くならないもの）/キャスト・プラ板・プラスチックダンボールなどのプラスチック
・その他、戦挙管理委員が取り扱いによっては周囲に危害を加えると判断したものは、持ち込みをご遠慮いただきます。
・危険行為（振り回す等）が見られ、戦挙管理委員が危険であると判断した場合、いかなる素材製であっても没収させていただく場合がございます。`.split("\n"),
			},
			{
				title: "撮影について",
				text: `・撮影は無料で行えますが、必ず被写体の政霊や総理の許可を取りましょう。
・動画撮影は厳禁です。
・盗撮など、周囲の迷惑となる撮影行為が見られた場合、戦挙管理委員の判断により注意または強制退場いただくこともございます。
・撮影は4階の会場、庭園、10階の和室のみ許可されています。被写体の背後に即売会ゾーンが入らないようにご注意ください。
・携帯電話による撮影も、許可された場所でのみ可能です。`.split("\n"),
			},
		],
	}),
	methods: {
		register() {
			window.open("https://docs.google.com/forms/d/e/1FAIpQLScDCMwNl-XvwLolwFuiRmvKYckblpi897mNGhL_pPdlCg2HHw/viewform?usp=sf_link");
		},
	},
	components: {
		FrameTemplate,
		Card,
	},
};
</script>

<style scoped>
.info {
	line-height: 1.75;
	margin: 10px 0;
	& .line {
		margin-left: 1rem;
	}
}

.registerButton {
	width: 100%;
	height: 3rem;
	font-size: 1.25rem;
	color: white;
	background-color: #284386;
	border-color: #001f65;
	border-radius: 5px;
}
</style>
